app/views/users/edit.html.erb

SELECT "tags".* FROM "tags"
---
		<strong>Interests:</strong>
		<%= f.collection_check_boxes :tag_ids, Tag.all, :id, :title  do |cb| %>