app/views/stories/_feed.html.erb

				<p><%= story.body %></p>
				<% if story.tags.any? %>
---
SELECT  1 AS one FROM "tags" INNER JOIN "story_tags" ON "tags"."id" = "story_tags"."tag_id" WHERE "story_tags"."story_id" = ? LIMIT 1  [["story_id", 3]]