app/views/stories/_form.html.erb

SELECT "tags".* FROM "tags"  ORDER BY "tags"."title" ASC
---
	<div class="form-group">
		<%= f.collection_select :tag_ids, Tag.order(:title), :id, :title, {}, { multiple: true, class: 'chosen-select' } %>