app/views/stories/feed.html.erb

SELECT "tags".id FROM "tags" INNER JOIN "story_tags" ON "tags"."id" = "story_tags"."tag_id" WHERE "story_tags"."story_id" = ?  [["story_id", 1]]
---
				<p><%= story.body %></p>
				<% if story.tags.any? %>