app/views/stories/index.html.erb

SELECT  1 AS one FROM "tags" INNER JOIN "story_tags" ON "tags"."id" = "story_tags"."tag_id" WHERE "story_tags"."story_id" = ? LIMIT 1  [["story_id", 3]]
---
    <p><%= truncate(story.body, length: 350) %></p>
    <% if story.tags.any? %>