app/controllers/stories_controller.rb

SELECT "tags".id FROM "tags" INNER JOIN "user_tags" ON "tags"."id" = "user_tags"."tag_id" WHERE "user_tags"."user_id" = ?  [["user_id", 1]]
SELECT  1 AS one FROM "tags" INNER JOIN "story_tags" ON "tags"."id" = "story_tags"."tag_id" WHERE "story_tags"."story_id" = ? LIMIT 1  [["story_id", 3]]
SELECT "stories".* FROM "stories"  ORDER BY created_at DESC
SELECT "tags".id FROM "tags" INNER JOIN "story_tags" ON "tags"."id" = "story_tags"."tag_id" WHERE "story_tags"."story_id" = ?  [["story_id", 1]]
---
	def index
		# @stories = Story.order('created_at DESC')
		@my_interests = current_user.tag_ids
		if @my_interests.any?
			@stories = Story.select { |s| (s.tag_ids & @my_interests).any? }

INSERT INTO "stories" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "what is in a name"], ["body", "its just as sweet"], ["created_at", "2016-10-06 16:39:29.480046"], ["updated_at", "2016-10-06 16:39:29.480046"]]
---
	def create
		@story = Story.new(story_params)
		if @story.save

UPDATE "stories" SET "body" = ?, "updated_at" = ? WHERE "stories"."id" = ?  [["body", "PublicActivity::Activity can be disabled"], ["updated_at", "2016-10-08 00:08:33.455184"], ["id", 1]]
---
	def update
		if @story.update_attributes(story_params)

UPDATE "stories" SET "likes" = ?, "updated_at" = ? WHERE "stories"."id" = ?  [["likes", 1], ["updated_at", "2016-10-08 00:10:19.886476"], ["id", 1]]
INSERT INTO "activities" ("parameters", "title", "key", "trackable_id", "trackable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def like
		without_tracking do
			@story.increment!(:likes)
		end
		@story.create_activity :like

SELECT "tags".id FROM "tags" INNER JOIN "user_tags" ON "tags"."id" = "user_tags"."tag_id" WHERE "user_tags"."user_id" = ?  [["user_id", 1]]
SELECT  1 AS one FROM "tags" INNER JOIN "story_tags" ON "tags"."id" = "story_tags"."tag_id" WHERE "story_tags"."story_id" = ? LIMIT 1  [["story_id", 5]]
SELECT "stories".* FROM "stories"
SELECT "tags".id FROM "tags" INNER JOIN "story_tags" ON "tags"."id" = "story_tags"."tag_id" WHERE "story_tags"."story_id" = ?  [["story_id", 1]]
---
	def feed
		@my_interests = current_user.tag_ids
		if @my_interests.any?
			@stories = Story.select { |s| (s.tag_ids & @my_interests).any? }

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", 1]]
---
	def find_story
		@story = Story.find(params[:id])

SELECT  "activities".* FROM "activities"  ORDER BY created_at DESC LIMIT 20
---
	def load_activities
		@activities = PublicActivity::Activity.order('created_at DESC').limit(20)