app/controllers/users_controller.rb

 def load_activities
      @activities = PublicActivity::Activity.order('created_at DESC').limit(20)
---
SELECT  "activities".* FROM "activities"  ORDER BY created_at DESC LIMIT 20